app/controllers/informations_controller.rb

  def show
    @info = Information.find(params[:id])
---
SELECT  "information".* FROM "information" WHERE "information"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

  def create
    @info = Information.new(info_params)
    if @info.save
---
INSERT INTO "information" ("title", "created_at", "updated_at", "avatar_file_name", "avatar_content_type", "avatar_file_size", "avatar_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def destroy
    @info = Information.find(params[:id])
    if @info.destroy
---
SELECT  "information".* FROM "information" WHERE "information"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "information" WHERE "information"."id" = $1  [["id", 7]]