app/controllers/products_controller.rb

SELECT "products".* FROM "products"
SELECT "information".* FROM "information"
---
  def index
    @products = Product.all
    @informations = Information.all

INSERT INTO "products" ("name", "model", "type_of_product", "come_from", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", ""], ["model", ""], ["type_of_product", ""], ["come_from", ""], ["created_at", 2016-10-15 14:06:32 UTC], ["updated_at", 2016-10-15 14:06:32 UTC]]
---
  def create
    @product = Product.new(product_params)
    if @product.save

UPDATE "products" SET "avatar_file_name" = $1, "avatar_file_size" = $2, "avatar_updated_at" = $3, "updated_at" = $4 WHERE "products"."id" = $5  [["avatar_file_name", "fruit01.jpg"], ["avatar_file_size", 11466], ["avatar_updated_at", 2016-10-19 09:00:50 UTC], ["updated_at", 2016-10-19 09:00:50 UTC], ["id", 34]]
---
  def update
    if @product.update_attributes(product_params)

DELETE FROM "products" WHERE "products"."id" = $1  [["id", 19]]
---
  def destroy
    if @product.destroy